<a href="https://colab.research.google.com/github/theysee/sberbank_reboot/blob/master/Test.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [0]:
#Тест

In [0]:
#https://docs.google.com/forms/d/164DJQWX4jTVtjK88ukydzT69KQO-h-YPoicVyFEU0y8/alreadyresponded?edit_requested=true

In [1]:
!pip install PyMySQL

Collecting PyMySQL
  Downloading https://files.pythonhosted.org/packages/ed/39/15045ae46f2a123019aa968dfcba0396c161c20f855f11dea6796bcaae95/PyMySQL-0.9.3-py2.py3-none-any.whl (47kB)
     |████████████████████████████████| 51kB 2.6MB/s
Installing collected packages: PyMySQL
Successfully installed PyMySQL-0.9.3

In [0]:
import pymysql
import numpy as np
import pandas as pd

DB_HOST = '89.223.95.235'
DB_USER = 'student_12'
DB_USER_PASSWORD = 'student_12'
DB_NAME = 'student_12'

In [3]:
conn = pymysql.connect(DB_HOST, DB_USER, DB_USER_PASSWORD, DB_NAME)
pd.read_sql_query("show tables", conn)

  Tables_in_student_12
0              annonce
1               events

In [5]:
df = pd.DataFrame({'colname1': [1, 2, 3], 'colname2': [4, 5, 6]})
df['colname3'] = [7,8,9]
df

   colname1  colname2  colname3
0         1         4         7
1         2         5         8
2         3         6         9

In [6]:
# Решение №2
df[['colname1', 'colname2', 'colname1']].groupby('colname2').max()

          colname1  colname1
colname2
4                1         1
5                2         2
6                3         3

In [0]:
# Решение №1
df.loc[(df['colname1'] == df['colname1'].min()) |  (df['colname1'] == df['colname1'].max())][['colname1', 'colname2']].groupby('colname2').max()
# Решение №2
df[['colname1', 'colname2', 'colname1']].groupby('colname2').max()

          colname1
colname2
4                1
6                3